<?php include_once 'main.php' ?>
<!doctype html>
<html lang="uk">
<head>
    <title>ДЗ №3</title>
    <link rel="stylesheet" href="static/style.css" type="text/css">
</head>
<body>
    <div>
        <h1>ДЗ №3</h1>
        <ol>
            <li>
                <b>Вивести певну кількість зірочок відповідно до числа з масиву.</b>
                <?=outputStars()?>
            </li>
            <li>
                <b>Розділити масив зі значення типу int|float|string на три окремі масиви відповідно до типів елементів.</b>
                <?=splitArray()?>
            </li>
            <li>
                <b>Є асоціативний масив книг. Збільшити ціну історичних книг на 20%, створити масив, де будуть лише детективи.</b>
                <?=manageBooks()?>
            </li>
            <li>
                <b>Створити новий масив, де ключ - це жанр, а значення - загальна вартість книг цього жанру.</b>
                <?=getGenresSummary()?>
            </li>
            <li>
                <b>Відобразити масив країн, міст, брендів як випадаючий список.</b>
                <?=arrayToSelect()?>
            </li>
            <li>
                <b>Дано масив покупців та масив товарів. Вивести, які товари зміг купити кожен покупець, та на яку суму.</b>
                <?=check()?>
            </li>
        </ol>
    </div>
</body>
</html>
<?php ob_end_flush();